src/DataProcessors/ГрупповаяОбработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ГрупповаяОбработка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимСценария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьВФоне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючФоновогоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндикаторПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВременногоХранилищаДляВнутреннегоОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТихийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПерезаписыватьАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьБазуПослеОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГрупповойОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключатьСеансы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешатьМножественныйПодборОдногоЭлемента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыТестирования</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОпределениеУстанавливаемогоРелизаОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПараллельныхПроцессов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбработки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыГрупповойОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонфигураций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обработчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РелизОбновления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановитьРелизОбновления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеКонфигураций</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыгружатьАрхив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоматическиПерезаписыватьАрхив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрыватьБазуПослеОбновления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтключатьСеансы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоОпределениеУстанавливаемогоРелизаОбновления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилаОбъединения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПравилаОбъединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/СтатусыИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыИнформационныхБаз</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тестовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизОбновления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоддержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталогИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксАрхива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПерезаписыватьАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьБазуПослеОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленаБлокировкаCеансов</Name>
					<Comment>Установлена блокировка сеансов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленаБлокировкаРегламентныхЗаданий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяОбработка</Name>
					<Comment>Используется для системных целей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверSQL</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхиваSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБДSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбновления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбновлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьПроверкуСоответствияРелизов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантХраненияФайлаАрхиваВБазе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыХраненияАрхиваВБазе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВБазеСсылкиНаВнешниеФайлыАрхивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереопределитьГлобальныеПараметрыДействийСАрхивами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизТехнологическойПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РелизыТехнологическойПлатформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКонфигураций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодключениеКХранилищуПриЗапускеКонфигуратора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ГрупповаяОбработка/Forms/ФормаПараметрыЗаполнения/Ext/Form/Module.bsl
&НаКлиенте
//
//
Процедура УправлениеФормой()

	Элементы.ПараметрВидКонфигурации.Доступность = НЕ ЗначениеЗаполнено(ЭтаФорма.ПараметрРелизОбновления);	
	Элементы.КнопкаИзменитьРежим.Заголовок = ?(ЭтаФорма.РасширенныйРежим, "Простой", "Расширенный") + " режим отбора";
	Элементы.ГруппаПростойРежим.Видимость = НЕ ЭтаФорма.РасширенныйРежим;
	Элементы.ГруппаРасширенныйРежим.Видимость = ЭтаФорма.РасширенныйРежим;
	
КонецПроцедуры


&НаКлиенте
//
//
Процедура Отмена(Команда)
	ЗакрытьФорму(СформироватьПараметры(Ложь));
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОК(Команда)
	
	ПараметрыЗаполнения = СформироватьПараметры(Истина);
	ПараметрыЗаполнения.Выполнить = Истина;
	
	ЗакрытьФорму(ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
//
//
Функция СформироватьПараметры(ПараметрВыполнить = Ложь)
	ПараметрыЗаполнения = Новый Структура;		
	ПараметрыЗаполнения.Вставить("Выполнить", ПараметрВыполнить);
	ПараметрыЗаполнения.Вставить("Список", Неопределено);
	
	Если ПараметрВыполнить Тогда
		ЗаполнитьПараметры(ПараметрыЗаполнения);
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
КонецФункции

&НаСервере
//
//
Функция ЗаполнитьПараметры(ПараметрыЗаполнения)
	
	Результат = Неопределено;
	
	Если НЕ ЭтаФорма.РасширенныйРежим Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = ПолучитьТекстЗапроса();
		Если ЗначениеЗаполнено(ЭтаФорма.ПараметрРелизОбновления) Тогда
			Запрос.Текст = Запрос.Текст + " И ИнформационныеБазы.РелизОбновления = &ПараметрРелизОбновления ";
			Запрос.УстановитьПараметр("ПараметрРелизОбновления", ЭтаФорма.ПараметрРелизОбновления);		
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтаФорма.ПараметрВидКонфигурации) Тогда
			Запрос.Текст = Запрос.Текст + " И ИнформационныеБазы.ВидКонфигурации = &ПараметрВидКонфигурации ";
			Запрос.УстановитьПараметр("ПараметрВидКонфигурации", ЭтаФорма.ПараметрВидКонфигурации);
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтаФорма.ПараметрСтатусПоддержки) Тогда
			Запрос.Текст = Запрос.Текст + " И ИнформационныеБазы.СтатусПоддержки = &ПараметрСтатусПоддержки ";
			Запрос.УстановитьПараметр("ПараметрСтатусПоддержки", ЭтаФорма.ПараметрСтатусПоддержки);		
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ИнформационныеБазы.ВидКонфигурации, ИнформационныеБазы.Наименование";
		Результат = Запрос.Выполнить().Выгрузить();
	Иначе 
		СхемаКомпоновкиДанных=новый СхемаКомпоновкиДанных;
		источникДанных=СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
		источникДанных.Имя="ИсточникДанных1";
		источникДанных.ТипИсточникаДанных="local";
		Наборданных=СхемаКомпоновкиДанных.НаборыДанных.Добавить(тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		Наборданных.ИсточникДанных="ИсточникДанных1";
		Наборданных.АвтоЗаполнениеДоступныхПолей=Истина;
		Наборданных.Запрос=ПолучитьТекстЗапроса();
		Наборданных.Имя="Наборданных1";
		ВременнаяКомпоновка = новый КомпоновщикНастроекКомпоновкиДанных;
		ВременнаяКомпоновка.Инициализировать(новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,УникальныйИдентификатор)));
		ВременнаяКомпоновка.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		для каждого элемент из КомпоновщикНастроек.Настройки.Отбор.Элементы цикл
			новаястрока=ВременнаяКомпоновка.Настройки.Отбор.Элементы.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(новаястрока,элемент);
		КонецЦикла;
		Настройки=ВременнаяКомпоновка.Настройки;
		Настройки.Структура.Очистить();
		Настройки.Выбор.Элементы.Очистить();
		
		ПолеВыбора = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("ИнформационнаяБаза");
		ПолеВыбора.Использование = Истина;
		
		ПолеВыбора = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("РелизОбновления");
		ПолеВыбора.Использование = Истина;
		
		ПолеВыбора = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("ВидКонфигурации");
		ПолеВыбора.Использование = Истина;
		
		ПолеВыбора = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("Обработчик");
		ПолеВыбора.Использование = Истина;
		
		ПолеВыбора = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("ХранилищеКонфигураций");
		ПолеВыбора.Использование = Истина;
		
		ПолеВыбора = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("Обрабатывать");
		ПолеВыбора.Использование = Истина;
		
		ГруппировкаКомпоновкиДанных = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ГруппировкаКомпоновкиДанных.Имя = "ИнформационнаяБаза";
		ГруппировкаКомпоновкиДанных.Использование = Истина;
		ДетальныеЗаписиГруппировкиСклад = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ДетальныеЗаписиГруппировкиСклад.Использование = Истина;
		
		Результат = Новый ТаблицаЗначений;  
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		ВременнаяКомпоновка.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(Результат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
	КонецЕсли;
	
	ПараметрыЗаполнения.Список = ПоместитьВоВременноеХранилище(Результат);
	
	
	Возврат ПараметрыЗаполнения;
КонецФункции

&НаКлиенте
//
//
Процедура ЗакрытьФорму(ПараметрыЗаполнения)
	ЭтаФорма.Закрыть(ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПараметрРелизОбновленияПриИзменении(Элемент)
	ЭтаФорма.ПараметрВидКонфигурации = ЗадачиНаСервере.ПолучитьЗначениеРеквизита(ЭтаФорма.ПараметрРелизОбновления, "ВидКонфигурации");
	УправлениеФормой();
КонецПроцедуры

&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ПараметрСтатусИБ = Перечисления.СтатусыИнформационныхБаз.Рабочая;
	
	Текстзапроса = ПолучитьТекстЗапроса();
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "local";
	Наборданных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Наборданных.ИсточникДанных = "ИсточникДанных1";
	Наборданных.АвтоЗаполнениеДоступныхПолей = Истина;
	Наборданных.Запрос = Текстзапроса;
	Наборданных.Имя = "Наборданных1";
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,УникальныйИдентификатор)));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
//
//
Процедура КнопкаИзменитьРежим(Команда)
	ЭтаФорма.РасширенныйРежим = НЕ ЭтаФорма.РасширенныйРежим;
	УправлениеФормой();
КонецПроцедуры

&НаСервере
//
//
Функция ПолучитьТекстЗапроса()
		
	ТекстЗапроса = "ВЫБРАТЬ
	|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза,
	|	ИнформационныеБазы.РелизОбновления,
	|	ИнформационныеБазы.ВидКонфигурации,
	|	ИнформационныеБазы.Обработчик,
	|	ИнформационныеБазы.ХранилищеКонфигураций,
	|	ИСТИНА КАК Обрабатывать
	|ИЗ
	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	|ГДЕ
	|	НЕ ИнформационныеБазы.ПометкаУдаления
	|	И НЕ ИнформационныеБазы.ВыполняетсяОбработка";
	
	
	Возврат ТекстЗапроса;
КонецФункции
